self-oscillating_cylinder_openfoam10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

// startTime       0;

stopAt          endTime;

endTime         2000.0;

deltaT          0.1;

maxCo           2.0;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
  
    forces
    {
        type                forces;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;

        patches             (cylinder);
        p                   p;
        U                   U;
        rho                 rhoInf;
        log                 true; 
        CofR                (0 0 0);     
        rhoInf              1.00;
    }


    sixDoFRigidBodyState
    {
        type               sixDoFRigidBodyState;
        libs               ("libsixDoFRigidBodyState.so");
        angleFormat        degrees;
        writeControl       timeStep;
        writeInterval      1;
    }

};





