self-oscillating_cylinder_openfoam10/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so" "libsixDoFRigidBodyMotion.so");

    motionSolver    sixDoFRigidBodyMotion;

    displacementLaplacianCoeffs
   {
    diffusivity  inverseDistance 2.0 (cylinder);
   }

    patches         (cylinder);
    innerDistance   0.4;
    outerDistance   4.0;

    mass            117.10;
    centreOfMass    (0.0 0.0 0.0);
    momentOfInertia (0.049087 0.049087 1.0);
    orientation
    (
    1 0 0
    0 1 0
    0 0 1
    );
    velocity        (0.0  0.0  0.0);
    angularMomentum (0.0  0.0  0.0);
    g               (0.0  0.0  0.0);

    rho             rhoInf;
    rhoInf          1;
    report          on;
    reportToFile    on;

    accelerationRelaxation 1.0;
    accelerationDamping    1.0;

    solver
    {
        type symplectic;
    }

    constraints
    {
        xyplane
        {
            sixDoFRigidBodyMotionConstraint   plane;
            normal                            (0 0 1);
        }

        yLine
        {
            sixDoFRigidBodyMotionConstraint line;
            centreOfRotation    (0.0 0.0 0.0);
            direction           (0 1 0);
        }

        xAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis                (1 0 0);
        }
        yAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis                (0 1 0);
        }
        zAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis                (0 0 1);
        }
    }

    restraints
    {
        verticalSpring
        {
            sixDoFRigidBodyMotionRestraint linearSpring;

            anchor          (0.0 0.0 0.0);
            refAttachmentPt (0.0 0.0 0.0);
            stiffness       184.92;
            damping         0.35317;
            restLength      0;
        }
        // axialSpring
        // {
        //     sixDoFRigidBodyMotionRestraint linearAxialAngularSpring;

        //     axis            (0 0 1);
        //     stiffness       700;
        //     damping         0.5;
        //     referenceOrientation $orientation;
        // }
    }
}







   


    





// ************************************************************************* //
