self-oscillating_cylinder_openfoam10/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.1 0 0);

boundaryField
{
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1.1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
